In [15]:
import numpy as np
import pandas as pd

In [16]:
df = pd.read_csv(r"C:\Users\Dell\Downloads\Titanic_training_dataset (1).csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [88]:
k = df.groupby('Embarked')
k.first()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Starts_With_Q,Starts_With_V
Embarked,,,,,,,,,,,,,
C,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00000,1,0,PC 17599,71.2833,C85,False,False
Q,6,0,3,"Moran, Mr. James",male,25.14062,0,0,330877,8.4583,C78,False,False
S,1,0,3,"Braund, Mr. Owen Harris",male,22.00000,1,0,A/5 21171,7.2500,C123,False,False

In [18]:
df.groupby('Pclass')["Age"].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [19]:
# class1_avg = df.loc[df['Pclass']==1,'Age'].mean()
# df.loc[df['Age'].isnull() & df["Pclass"]==1,"Age"] = class1_avg

# class2_avg = df.loc[df['Pclass']==2,'Age'].mean()
# df.loc[df['Age'].isnull() & df["Pclass"]==2,"Age"] = class2_avg

# class3_avg = df.loc[df['Pclass']==3,'Age'].mean()
# df.loc[df['Age'].isnull() & df["Pclass"]==3,"Age"] = class3_avg

df['Age'] = df.groupby('Pclass')['Age'].transform(lambda x: x.fillna(x.mean()))

In [20]:
df["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [21]:
df["Embarked"].fillna("S",inplace=True)

# What is the probability of a male surviving the sinking Titanic?

In [22]:
df.groupby(["Survived","Sex"]).Survived.count()

Survived  Sex
0         female     81
          male      468
1         female    233
          male      109
Name: Survived, dtype: int64

In [23]:
prob_of_male_survival = 109/(109+233+468+81)
prob_of_male_survival

0.122334455667789

In [ ]:
#pd.pivot_table(df,values ="", index = "Sex",columns = "Survived", observed = True ,aggfunc = "count")

# Which of these variables/factors has the highest impact on whether a person will survive.  a.SibSp    b. Age        c. Sex        d. PClass

In [45]:
df.corr() #for sex change the string variable into 0 and 1 - categorical

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.035256,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.050504,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.403858,0.083081,0.018443,-0.549500
Age,0.035256,-0.050504,-0.403858,1.000000,-0.243452,-0.175799,0.120886
SibSp,-0.057527,-0.035322,0.083081,-0.243452,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.175799,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.120886,0.159651,0.216225,1.000000

# Passengers embarked from which port have the highest survival rate?a. Queenstown  b. Southampton    c. Cherbourg  d. No significant difference

In [80]:
# df.groupby(["Embarked","Survived"]).Survived.count()
df.groupby('Embarked').agg({'Survived':['count','sum']})
#here add an other column for the percentage
#before doing any operations here we must flatten the table here because it uses multi indexing columns

         Survived
            count  sum
Embarked
C             168   93
Q              77   30
S             646  219

In [200]:
C_Survival_Rate = 93/(93+75)
C_Survival_Rate

0.5535714285714286

In [201]:
S_Survival_Rate = 219/(219+427)
S_Survival_Rate

0.33900928792569657

In [202]:
Q_Survival_Rate = 30/(30+47)
Q_Survival_Rate

0.38961038961038963

# What is the name & age of the eldest surviving male passenger

In [145]:
df1 = pd.DataFrame(df[df["Survived"]==1])
df1[df1["Sex"]=="male"].sort_values(by=["Age"],ascending=False) #use the groupby first function

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S
570,571,1,2,"Harris, Mr. George",male,62.00,0,0,S.W./PP 752,10.5000,NaN,S
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.00,1,1,13567,79.2000,B41,C
647,648,1,1,"Simonius-Blumer, Col. Oberst Alfons",male,56.00,0,0,13213,35.5000,A26,C
449,450,1,1,"Peuchen, Major. Arthur Godfrey",male,52.00,0,0,113786,30.5000,C104,S
...,...,...,...,...,...,...,...,...,...,...,...,...
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C

# For every 100 men and 100 women who boarded the Titanic, how many men and how many women Survived? (Only persons with Age >= 18 are considered men & women) a.(76, 17) b. (75,19) c. (17, 76) d. (19, 76)

In [31]:
df.loc[df.Age>=18].groupby(["Sex","Survived"]).Survived.count() #here add an other column using the aggregate function for 
#displaying the percentage

Sex     Survived
female  0            64
        1           195
male    0           433
        1            86
Name: Survived, dtype: int64

In [154]:
male_Survived_for_hun = (86/(86+433))*100
male_Survived_for_hun

16.570327552986512

In [155]:
female_Survived_for_hun = (64/(64+195))*100
female_Survived_for_hun

24.71042471042471

# Pick the correct statements a.Passengers with odd Ids have survived more than passengers with even ids b.No passenger with more than 5 siblings has survived. c. Passengers with more siblings have less survival rate and passengers with less siblings have higher survival rate. d.Among the ones who survived, there are more passengers with even number PassengerId

In [12]:
# df.groupby(df["PassengerId"]%2).agg({'Survived':'sum'})
df.groupby([df["PassengerId"]%2,"Survived"]).Survived.count() #add another column

PassengerId  Survived
0            0           261
             1           184
1            0           288
             1           158
Name: Survived, dtype: int64

In [161]:
even_id_survival_rate = 184/(184+261)
even_id_survival_rate

0.4134831460674157

In [162]:
odd_id_survival_rate = 158/(158+288)
odd_id_survival_rate

0.3542600896860987

In [163]:
df[df["SibSp"]>5]["Survived"].value_counts()

0    7
Name: Survived, dtype: int64

In [13]:
df.groupby(["SibSp","Survived"]).Survived.count() #add another column

SibSp  Survived
0      0           398
       1           210
1      0            97
       1           112
2      0            15
       1            13
3      0            12
       1             4
4      0            15
       1             3
5      0             5
8      0             7
Name: Survived, dtype: int64

In [171]:
survival_rate_0 = 210/(210+398)
survival_rate_1 = 112/(112+97)
survival_rate_2 = 13/(13+15)
survival_rate_3 = 4/(4+12)
survival_rate_4 = 3/(3+15)

# Which of the below statements is correct a. Every person whose name starts with Q has survived b.There’re 15 passengers whose name starts with V and none of them have survived c. Passengers who survived the Titanic has paid, on an average, more than double the fare paid by those who could not survive d.Lower the age, more the number of family accompanying the passenger

In [58]:
# df.filter(lambda df["Name"]: df["Name"].startswith("Q"))
df["Starts_With_Q"] = list(map(lambda x: x.startswith("Q") or x.startswith("q"), df["Name"])) 
df["Starts_With_V"] = list(map(lambda x: x.startswith("V") or x.startswith("v"), df["Name"])) 
df.groupby(["Starts_With_Q","Survived"]).Survived.count()

Starts_With_Q  Survived
False          0           549
               1           340
True           1             2
Name: Survived, dtype: int64

In [59]:
df.groupby(["Starts_With_V","Survived"]).Survived.count()

Starts_With_V  Survived
False          0           534
               1           342
True           0            15
Name: Survived, dtype: int64

In [63]:
df.groupby("Survived").agg({"Fare":np.mean})

               Fare
Survived
0         22.117887
1         48.395408

In [82]:
df.groupby(df['Name'].str.startswith("Q"))['Survived'].count()

Name
False    889
True       2
Name: Survived, dtype: int64

In [ ]:
#for the last option use pandas.cut to bin the continuous variable age into bins and in each bin check the number of people in
#it and their family members accompanying them

# Identify the correct statements among the following a. Most senior passengers (age above 60) have purchased a similar passenger class ticket. b. Only one passenger with 5 children has survived c. Most passengers who embarked from Southampton have survived d.Passengers with 1 or 2 siblings have a higher survival rate compared to rest

In [ ]:
#for the first one most senior passengers check the count of the group by for age greater than 60 for the PClass

In [69]:
df[df["Parch"]==5]["Survived"].value_counts()

0    4
1    1
Name: Survived, dtype: int64

In [70]:
df[df["Embarked"]=="S"]["Survived"].value_counts()

0    427
1    219
Name: Survived, dtype: int64

In [73]:
df.groupby(["SibSp"]).Survived.value_counts()

SibSp  Survived
0      0           398
       1           210
1      1           112
       0            97
2      0            15
       1            13
3      0            12
       1             4
4      0            15
       1             3
5      0             5
8      0             7
Name: Survived, dtype: int64

In [74]:
sib_1_or_2_surv_rate = (112+13)/(112+97+15+13)

In [75]:
sib_rest_surv_rate = (210+4+3)/(891-(112+97+15+13))